Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd
import numpy as np

df1 = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
df1.isna().sum()   ##to check no. of null values of each column

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [3]:
df1.describe()            ######to get information about each column

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
#To get the total unique values of variables
df1.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [5]:
df1.dtypes              # to check data type of each variables

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
df1= df1.sort_values(by='Fare',ascending =False)
print(df1.head())

     PassengerId  Survived  Pclass                                Name  \
258          259         1       1                    Ward, Miss. Anna
737          738         1       1              Lesurer, Mr. Gustave J
679          680         1       1  Cardeza, Mr. Thomas Drake Martinez
88            89         1       1          Fortune, Miss. Mabel Helen
27            28         0       1      Fortune, Mr. Charles Alexander

        Sex   Age  SibSp  Parch    Ticket      Fare        Cabin Embarked
258  female  35.0      0      0  PC 17755  512.3292          NaN        C
737    male  35.0      0      0  PC 17755  512.3292         B101        C
679    male  36.0      0      1  PC 17755  512.3292  B51 B53 B55        C
88   female  23.0      3      2     19950  263.0000  C23 C25 C27        S
27     male  19.0      3      2     19950  263.0000  C23 C25 C27        S

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [9]:
df5 =pd.DataFrame({"Values":[54,67,78,89,100]})
df5

   Values
0      54
1      67
2      78
3      89
4     100

In [10]:
sum1 = df5.iloc[0:3].sum()

In [11]:
sum1

Values    199
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [12]:
df= pd.DataFrame({"Text":["abinash pradhan","i am currently working as data scientist","i am learing data science from pwskills"]})

In [13]:
df

                                       Text
0                           abinash pradhan
1  i am currently working as data scientist
2   i am learing data science from pwskills

In [14]:
df["Word_count"] = df["Text"].apply(lambda x:len(x.split()))
df

                                       Text  Word_count
0                           abinash pradhan           2
1  i am currently working as data scientist           7
2   i am learing data science from pwskills           7

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size()----> Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

DataFrame.shape()------>The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.
this gives idea about total rows and columns present in the dataframe.

In [15]:
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
  
# dataframe.size
size = data.size
print(size)
shape=data.shape
print(shape)

4122
(458, 9)

Q6. Which function of pandas do we use to read an excel file?

pd.read_excel()

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.


The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [16]:
df2= pd.DataFrame({"Email":['username@domain.com','john.doe@example.com','rkl.abinash@gmail.com']})

In [17]:
df2

                   Email
0    username@domain.com
1   john.doe@example.com
2  rkl.abinash@gmail.com

In [18]:
df2["Username"]= df2["Email"].apply(lambda x:x.split("@")[0])
df2

                   Email     Username
0    username@domain.com     username
1   john.doe@example.com     john.doe
2  rkl.abinash@gmail.com  rkl.abinash

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [20]:
df6 =pd.DataFrame({"Values":[54,67,78,89,100]})
df6

   Values
0      54
1      67
2      78
3      89
4     100

In [21]:
Mean= df6["Values"].mean()
Median= df6["Values"].median()
SD= df6["Values"].std()
print("Mean value is",Mean)
print("Median value is",Median)
print("Standard Deviation value is",SD)

Mean value is 77.6
Median value is 78.0
Standard Deviation value is 18.03607496103296

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [22]:
df7 = pd.DataFrame({"Sales":[2000,7000,5000,9000,4000,7000,5900,5600,4600,3450,4500,5600],
                   "Date":["2023-04-23","2023-04-24","2023-04-25","2023-04-26","2023-04-27",'2023-04-28', '2023-04-29', '2023-04-30','2023-05-01', '2023-05-02', '2023-05-03', '2023-05-04']})

In [23]:
df7["Date"] = pd.to_datetime(df7["Date"])

In [24]:
df7

    Sales       Date
0    2000 2023-04-23
1    7000 2023-04-24
2    5000 2023-04-25
3    9000 2023-04-26
4    4000 2023-04-27
5    7000 2023-04-28
6    5900 2023-04-29
7    5600 2023-04-30
8    4600 2023-05-01
9    3450 2023-05-02
10   4500 2023-05-03
11   5600 2023-05-04

In [25]:
df7["MovingAverage"]= df7["Sales"].rolling(window=7).mean()
df7

    Sales       Date  MovingAverage
0    2000 2023-04-23            NaN
1    7000 2023-04-24            NaN
2    5000 2023-04-25            NaN
3    9000 2023-04-26            NaN
4    4000 2023-04-27            NaN
5    7000 2023-04-28            NaN
6    5900 2023-04-29    5700.000000
7    5600 2023-04-30    6214.285714
8    4600 2023-05-01    5871.428571
9    3450 2023-05-02    5650.000000
10   4500 2023-05-03    5007.142857
11   5600 2023-05-04    5235.714286

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05


Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday

In [26]:
df8 = pd.DataFrame({"Date": ["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05"]})
df8

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [27]:
df8["Date"]= pd.to_datetime(df8["Date"])

In [28]:
df8['Weekday'] = df8['Date'].dt.day_name()

In [29]:
df8

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [34]:
df = pd.DataFrame(np.random.random((200,3)))
df['Date'] = pd.date_range('2023-1-1', periods=200, freq='D')
mask = (df['Date'] >= '2023-1-1') & (df['Date'] <= '2023-1-31')
df= df[["Date"]]
print(df.loc[mask])

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

pandas library
import pandas as pd